/*
 *  Copyright (C) 2012 Altera Corporation <www.altera.com>
 *
 * SPDX-License-Identifier:	GPL-2.0+
 */

/*
#include <common.h>
#include <asm/io.h>
#include <asm/pl310.h>
#include <asm/u-boot.h>
#include <asm/utils.h>
#include <image.h>
#include <asm/arch/reset_manager.h>
#include <spl.h>
#include <asm/arch/system_manager.h>
#include <asm/arch/freeze_controller.h>
#include <asm/arch/clock_manager.h>
#include <asm/arch/scan_manager.h>
#include <asm/arch/sdram.h>
#include <asm/arch/scu.h>
#include <asm/arch/nic301.h>

DECLARE_GLOBAL_DATA_PTR;

static struct pl310_regs *const pl310 =
	(struct pl310_regs *)CONFIG_SYS_PL310_BASE;
static struct scu_registers *scu_regs =
	(struct scu_registers *)SOCFPGA_MPUSCU_ADDRESS;
static struct socfpga_system_manager *sysmgr_regs =
	(struct socfpga_system_manager *)SOCFPGA_SYSMGR_ADDRESS;
*/

//u32 spl_boot_device(void)
//{
//	const u32 bsel = readl(&sysmgr_regs->bootinfo);
//
//	switch (bsel & 0x7) {
//	case 0x1:	/* FPGA (HPS2FPGA Bridge) */
//		return BOOT_DEVICE_RAM;
//	case 0x2:	/* NAND Flash (1.8V) */
//	case 0x3:	/* NAND Flash (3.0V) */
//		socfpga_per_reset(SOCFPGA_RESET(NAND), 0);
//		return BOOT_DEVICE_NAND;
//	case 0x4:	/* SD/MMC External Transceiver (1.8V) */
//	case 0x5:	/* SD/MMC Internal Transceiver (3.0V) */
//		socfpga_per_reset(SOCFPGA_RESET(SDMMC), 0);
//		socfpga_per_reset(SOCFPGA_RESET(DMA), 0);
//		return BOOT_DEVICE_MMC1;
//	case 0x6:	/* QSPI Flash (1.8V) */
//	case 0x7:	/* QSPI Flash (3.0V) */

 * These are only valid for small values of "off" (< 1<<12)
 */
#define __raw_base_writeb(val,base,off)	__arch_base_putb(val,base,off)
#define __raw_base_writew(val,base,off)	__arch_base_putw(val,base,off)
#define __raw_base_writel(val,base,off)	__arch_base_putl(val,base,off)

#define __raw_base_readb(base,off)	__arch_base_getb(base,off)
#define __raw_base_readw(base,off)	__arch_base_getw(base,off)
#define __raw_base_readl(base,off)	__arch_base_getl(base,off)

/*
 * Clear and set bits in one shot. These macros can be used to clear and
 * set multiple bits in a register using a single call. These macros can
 * also be used to set a multiple-bit bit pattern using a mask, by
 * specifying the mask in the 'clear' parameter and the new bit pattern
 * in the 'set' parameter.
 */

#define out_arch(type,endian,a,v)	__raw_write##type(cpu_to_##endian(v),a)
#define in_arch(type,endian,a)		endian##_to_cpu(__raw_read##type(a))

#define out_le64(a,v)	out_arch(q,le64,a,v)
#define out_le32(a,v)	out_arch(l,le32,a,v)
#define out_le16(a,v)	out_arch(w,le16,a,v)

#define in_le64(a)	in_arch(q,le64,a)
#define in_le32(a)	in_arch(l,le32,a)
#define in_le16(a)	in_arch(w,le16,a)

#define out_be32(a,v)	out_arch(l,be32,a,v)
#define out_be16(a,v)	out_arch(w,be16,a,v)

#define in_be32(a)	in_arch(l,be32,a)
#define in_be16(a)	in_arch(w,be16,a)

#define out_8(a,v)	__raw_writeb(v,a)
#define in_8(a)		__raw_readb(a)

#define clrbits(type, addr, clear) \
	out_##type((addr), in_##type(addr) & ~(clear))

#define setbits(type, addr, set) \
	out_##type((addr), in_##type(addr) | (set))

#define clrsetbits(type, addr, clear, set) \
	out_##type((addr), (in_##type(addr) & ~(clear)) | (set))

#define clrbits_be32(addr, clear) clrbits(be32, addr, clear)
#define setbits_be32(addr, set) setbits(be32, addr, set)
#define clrsetbits_be32(addr, clear, set) clrsetbits(be32, addr, clear, set)

#define clrbits_le32(addr, clear) clrbits(le32, addr, clear)
#define setbits_le32(addr, set) setbits(le32, addr, set)
#define clrsetbits_le32(addr, clear, set) clrsetbits(le32, addr, clear, set)

#define clrbits_be16(addr, clear) clrbits(be16, addr, clear)
#define setbits_be16(addr, set) setbits(be16, addr, set)
#define clrsetbits_be16(addr, clear, set) clrsetbits(be16, addr, clear, set)

#define clrbits_le16(addr, clear) clrbits(le16, addr, clear)
#define setbits_le16(addr, set) setbits(le16, addr, set)
#define clrsetbits_le16(addr, clear, set) clrsetbits(le16, addr, clear, set)

#define clrbits_8(addr, clear) clrbits(8, addr, clear)
#define setbits_8(addr, set) setbits(8, addr, set)
#define clrsetbits_8(addr, clear, set) clrsetbits(8, addr, clear, set)

// ac5
#define SOCFPGA_MPUL2_ADDRESS		0xfffef000
// a10
//#define SOCFPGA_MPUL2_ADDRESS		0xfffff000

#define SOCFPGA_L3REGS_ADDRESS		0xff800000
#define SOCFPGA_MPUSCU_ADDRESS		0xfffec000
#define SOCFPGA_SYSMGR_ADDRESS		0xffd08000
#define CONFIG_SYS_PL310_BASE		SOCFPGA_MPUL2_ADDRESS
#define SOCFPGA_RSTMGR_ADDRESS		0xffd05000

#define SOCFPGA_FPGAMGRREGS_ADDRESS	0xff706000


struct scu_registers {
	u32	ctrl;			/* 0x00 */
	u32	cfg;
	u32	cpsr;
	u32	iassr;
	u32	_pad_0x10_0x3c[12];	/* 0x10 */
	u32	fsar;			/* 0x40 */
	u32	fear;
	u32	_pad_0x48_0x50[2];
	u32	acr;			/* 0x54 */
	u32	sacr;
};

struct nic301_registers {
	u32	remap;				/* 0x0 */
	/* Security Register Group */
	u32	_pad_0x4_0x8[1];
	u32	l4main;
	u32	l4sp;
	u32	l4mp;				/* 0x10 */
	u32	l4osc1;
	u32	l4spim;
	u32	stm;
	u32	lwhps2fpgaregs;			/* 0x20 */
	u32	_pad_0x24_0x28[1];
	u32	usb1;
	u32	nanddata;
	u32	_pad_0x30_0x80[20];
	u32	usb0;				/* 0x80 */
	u32	nandregs;
	u32	qspidata;
	u32	fpgamgrdata;
	u32	hps2fpgaregs;			/* 0x90 */
	u32	acp;
	u32	rom;
	u32	ocram;
	u32	sdrdata;			/* 0xA0 */
	u32	_pad_0xa4_0x1fd0[1995];
	/* ID Register Group */
	u32	periph_id_4;			/* 0x1FD0 */
	u32	_pad_0x1fd4_0x1fe0[3];
	u32	periph_id_0;			/* 0x1FE0 */
	u32	periph_id_1;
	u32	periph_id_2;
	u32	periph_id_3;
	u32	comp_id_0;			/* 0x1FF0 */
	u32	comp_id_1;
	u32	comp_id_2;
	u32	comp_id_3;
	u32	_pad_0x2000_0x2008[2];
	/* L4 MAIN */
	u32	l4main_fn_mod_bm_iss;
	u32	_pad_0x200c_0x3008[1023];
	/* L4 SP */
	u32	l4sp_fn_mod_bm_iss;
	u32	_pad_0x300c_0x4008[1023];
	/* L4 MP */
	u32	l4mp_fn_mod_bm_iss;
	u32	_pad_0x400c_0x5008[1023];
	/* L4 OSC1 */
	u32	l4osc_fn_mod_bm_iss;
	u32	_pad_0x500c_0x6008[1023];
	/* L4 SPIM */
	u32	l4spim_fn_mod_bm_iss;
	u32	_pad_0x600c_0x7008[1023];
	/* STM */
	u32	stm_fn_mod_bm_iss;
	u32	_pad_0x700c_0x7108[63];
	u32	stm_fn_mod;
	u32	_pad_0x710c_0x8008[959];
	/* LWHPS2FPGA */
	u32	lwhps2fpga_fn_mod_bm_iss;
	u32	_pad_0x800c_0x8108[63];
	u32	lwhps2fpga_fn_mod;
	u32	_pad_0x810c_0xa008[1983];
	/* USB1 */
	u32	usb1_fn_mod_bm_iss;
	u32	_pad_0xa00c_0xa044[14];
	u32	usb1_ahb_cntl;
	u32	_pad_0xa048_0xb008[1008];
	/* NANDDATA */
	u32	nanddata_fn_mod_bm_iss;
	u32	_pad_0xb00c_0xb108[63];
	u32	nanddata_fn_mod;
	u32	_pad_0xb10c_0x20008[21439];
	/* USB0 */
	u32	usb0_fn_mod_bm_iss;
	u32	_pad_0x2000c_0x20044[14];
	u32	usb0_ahb_cntl;
	u32	_pad_0x20048_0x21008[1008];
	/* NANDREGS */
	u32	nandregs_fn_mod_bm_iss;
	u32	_pad_0x2100c_0x21108[63];
	u32	nandregs_fn_mod;
	u32	_pad_0x2110c_0x22008[959];
	/* QSPIDATA */
	u32	qspidata_fn_mod_bm_iss;
	u32	_pad_0x2200c_0x22044[14];
	u32	qspidata_ahb_cntl;
	u32	_pad_0x22048_0x23008[1008];
	/* FPGAMGRDATA */
	u32	fpgamgrdata_fn_mod_bm_iss;
	u32	_pad_0x2300c_0x23040[13];
	u32	fpgamgrdata_wr_tidemark;	/* 0x23040 */
	u32	_pad_0x23044_0x23108[49];
	u32	fn_mod;
	u32	_pad_0x2310c_0x24008[959];
	/* HPS2FPGA */
	u32	hps2fpga_fn_mod_bm_iss;
	u32	_pad_0x2400c_0x24040[13];
	u32	hps2fpga_wr_tidemark;		/* 0x24040 */
	u32	_pad_0x24044_0x24108[49];
	u32	hps2fpga_fn_mod;
	u32	_pad_0x2410c_0x25008[959];
	/* ACP */
	u32	acp_fn_mod_bm_iss;
	u32	_pad_0x2500c_0x25108[63];
	u32	acp_fn_mod;
	u32	_pad_0x2510c_0x26008[959];
	/* Boot ROM */
	u32	bootrom_fn_mod_bm_iss;
	u32	_pad_0x2600c_0x26108[63];
	u32	bootrom_fn_mod;
	u32	_pad_0x2610c_0x27008[959];
	/* On-chip RAM */
	u32	ocram_fn_mod_bm_iss;
	u32	_pad_0x2700c_0x27040[13];
	u32	ocram_wr_tidemark;		/* 0x27040 */
	u32	_pad_0x27044_0x27108[49];
	u32	ocram_fn_mod;
	u32	_pad_0x2710c_0x42024[27590];
	/* DAP */
	u32	dap_fn_mod2;
	u32	dap_fn_mod_ahb;
	u32	_pad_0x4202c_0x42100[53];
	u32	dap_read_qos;			/* 0x42100 */
	u32	dap_write_qos;
	u32	dap_fn_mod;
	u32	_pad_0x4210c_0x43100[1021];
	/* MPU */
	u32	mpu_read_qos;			/* 0x43100 */
	u32	mpu_write_qos;
	u32	mpu_fn_mod;
	u32	_pad_0x4310c_0x44028[967];
	/* SDMMC */
	u32	sdmmc_fn_mod_ahb;
	u32	_pad_0x4402c_0x44100[53];
	u32	sdmmc_read_qos;			/* 0x44100 */
	u32	sdmmc_write_qos;
	u32	sdmmc_fn_mod;
	u32	_pad_0x4410c_0x45100[1021];
	/* DMA */
	u32	dma_read_qos;			/* 0x45100 */
	u32	dma_write_qos;
	u32	dma_fn_mod;
	u32	_pad_0x4510c_0x46040[973];
	/* FPGA2HPS */
	u32	fpga2hps_wr_tidemark;		/* 0x46040 */
	u32	_pad_0x46044_0x46100[47];
	u32	fpga2hps_read_qos;		/* 0x46100 */
	u32	fpga2hps_write_qos;
	u32	fpga2hps_fn_mod;
	u32	_pad_0x4610c_0x47100[1021];
	/* ETR */
	u32	etr_read_qos;			/* 0x47100 */
	u32	etr_write_qos;
	u32	etr_fn_mod;
	u32	_pad_0x4710c_0x48100[1021];
	/* EMAC0 */
	u32	emac0_read_qos;			/* 0x48100 */
	u32	emac0_write_qos;
	u32	emac0_fn_mod;
	u32	_pad_0x4810c_0x49100[1021];
	/* EMAC1 */
	u32	emac1_read_qos;			/* 0x49100 */
	u32	emac1_write_qos;
	u32	emac1_fn_mod;
	u32	_pad_0x4910c_0x4a028[967];
	/* USB0 */
	u32	usb0_fn_mod_ahb;
	u32	_pad_0x4a02c_0x4a100[53];
	u32	usb0_read_qos;			/* 0x4A100 */
	u32	usb0_write_qos;
	u32	usb0_fn_mod;
	u32	_pad_0x4a10c_0x4b100[1021];
	/* NAND */
	u32	nand_read_qos;			/* 0x4B100 */
	u32	nand_write_qos;
	u32	nand_fn_mod;
	u32	_pad_0x4b10c_0x4c028[967];
	/* USB1 */
	u32	usb1_fn_mod_ahb;
	u32	_pad_0x4c02c_0x4c100[53];
	u32	usb1_read_qos;			/* 0x4C100 */
	u32	usb1_write_qos;
	u32	usb1_fn_mod;
};

struct socfpga_system_manager {
	/* System Manager Module */
	u32	siliconid1;			/* 0x00 */
	u32	siliconid2;
	u32	_pad_0x8_0xf[2];
	u32	wddbg;				/* 0x10 */
	u32	bootinfo;
	u32	hpsinfo;
	u32	parityinj;
	/* FPGA Interface Group */
	u32	fpgaintfgrp_gbl;		/* 0x20 */
	u32	fpgaintfgrp_indiv;
	u32	fpgaintfgrp_module;
	u32	_pad_0x2c_0x2f;
	/* Scan Manager Group */
	u32	scanmgrgrp_ctrl;		/* 0x30 */
	u32	_pad_0x34_0x3f[3];
	/* Freeze Control Group */
	u32	frzctrl_vioctrl;		/* 0x40 */
	u32	_pad_0x44_0x4f[3];
	u32	frzctrl_hioctrl;		/* 0x50 */
	u32	frzctrl_src;
	u32	frzctrl_hwctrl;
	u32	_pad_0x5c_0x5f;
	/* EMAC Group */
	u32	emacgrp_ctrl;			/* 0x60 */
	u32	emacgrp_l3master;
	u32	_pad_0x68_0x6f[2];
	/* DMA Controller Group */
	u32	dmagrp_ctrl;			/* 0x70 */
	u32	dmagrp_persecurity;
	u32	_pad_0x78_0x7f[2];
	/* Preloader (initial software) Group */
	u32	iswgrp_handoff[8];		/* 0x80 */
	u32	_pad_0xa0_0xbf[8];		/* 0xa0 */
	/* Boot ROM Code Register Group */
	u32	romcodegrp_ctrl;		/* 0xc0 */
	u32	romcodegrp_cpu1startaddr;
	u32	romcodegrp_initswstate;
	u32	romcodegrp_initswlastld;
	u32	romcodegrp_bootromswstate;	/* 0xd0 */
	u32	__pad_0xd4_0xdf[3];
	/* Warm Boot from On-Chip RAM Group */
	u32	romcodegrp_warmramgrp_enable;	/* 0xe0 */
	u32	romcodegrp_warmramgrp_datastart;
	u32	romcodegrp_warmramgrp_length;
	u32	romcodegrp_warmramgrp_execution;
	u32	romcodegrp_warmramgrp_crc;	/* 0xf0 */
	u32	__pad_0xf4_0xff[3];
	/* Boot ROM Hardware Register Group */
	u32	romhwgrp_ctrl;			/* 0x100 */
	u32	_pad_0x104_0x107;
	/* SDMMC Controller Group */
	u32	sdmmcgrp_ctrl;
	u32	sdmmcgrp_l3master;
	/* NAND Flash Controller Register Group */
	u32	nandgrp_bootstrap;		/* 0x110 */
	u32	nandgrp_l3master;
	/* USB Controller Group */
	u32	usbgrp_l3master;
	u32	_pad_0x11c_0x13f[9];
	/* ECC Management Register Group */
	u32	eccgrp_l2;			/* 0x140 */
	u32	eccgrp_ocram;
	u32	eccgrp_usb0;
	u32	eccgrp_usb1;
	u32	eccgrp_emac0;			/* 0x150 */
	u32	eccgrp_emac1;
	u32	eccgrp_dma;
	u32	eccgrp_can0;
	u32	eccgrp_can1;			/* 0x160 */
	u32	eccgrp_nand;
	u32	eccgrp_qspi;
	u32	eccgrp_sdmmc;
	u32	_pad_0x170_0x3ff[164];
	/* Pin Mux Control Group */
	u32	emacio[20];			/* 0x400 */
	u32	flashio[12];			/* 0x450 */
	u32	generalio[28];			/* 0x480 */
	u32	_pad_0x4f0_0x4ff[4];
	u32	mixed1io[22];			/* 0x500 */
	u32	mixed2io[8];			/* 0x558 */
	u32	gplinmux[23];			/* 0x578 */
	u32	gplmux[71];			/* 0x5d4 */
	u32	nandusefpga;			/* 0x6f0 */
	u32	_pad_0x6f4;
	u32	rgmii1usefpga;			/* 0x6f8 */
	u32	_pad_0x6fc_0x700[2];
	u32	i2c0usefpga;			/* 0x704 */
	u32	sdmmcusefpga;			/* 0x708 */
	u32	_pad_0x70c_0x710[2];
	u32	rgmii0usefpga;			/* 0x714 */
	u32	_pad_0x718_0x720[3];
	u32	i2c3usefpga;			/* 0x724 */
	u32	i2c2usefpga;			/* 0x728 */
	u32	i2c1usefpga;			/* 0x72c */
	u32	spim1usefpga;			/* 0x730 */
	u32	_pad_0x734;
	u32	spim0usefpga;			/* 0x738 */
};


struct pl310_regs {
	u32 pl310_cache_id;
	u32 pl310_cache_type;
	u32 pad1[62];
	u32 pl310_ctrl;
	u32 pl310_aux_ctrl;
	u32 pl310_tag_latency_ctrl;
	u32 pl310_data_latency_ctrl;
	u32 pad2[60];
	u32 pl310_event_cnt_ctrl;
	u32 pl310_event_cnt1_cfg;
	u32 pl310_event_cnt0_cfg;
	u32 pl310_event_cnt1_val;
	u32 pl310_event_cnt0_val;
	u32 pl310_intr_mask;
	u32 pl310_masked_intr_stat;
	u32 pl310_raw_intr_stat;
	u32 pl310_intr_clear;
	u32 pad3[323];
	u32 pl310_cache_sync;
	u32 pad4[15];
	u32 pl310_inv_line_pa;
	u32 pad5[2];
	u32 pl310_inv_way;
	u32 pad6[12];
	u32 pl310_clean_line_pa;
	u32 pad7[1];
	u32 pl310_clean_line_idx;
	u32 pl310_clean_way;
	u32 pad8[12];
	u32 pl310_clean_inv_line_pa;
	u32 pad9[1];
	u32 pl310_clean_inv_line_idx;
	u32 pl310_clean_inv_way;
	u32 pad10[64];
	u32 pl310_lockdown_dbase;
	u32 pl310_lockdown_ibase;
	u32 pad11[190];
	u32 pl310_addr_filter_start;
	u32 pl310_addr_filter_end;
	u32 pad12[190];
	u32 pl310_test_operation;
	u32 pad13[3];
	u32 pl310_line_data;
	u32 pad14[7];
	u32 pl310_line_tag;
	u32 pad15[3];
	u32 pl310_debug_ctrl;
	u32 pad16[7];
	u32 pl310_prefetch_ctrl;
	u32 pad17[7];
	u32 pl310_power_ctrl;
};

struct socfpga_fpga_manager {
	/* FPGA Manager Module */
	u32	stat;			/* 0x00 */
	u32	ctrl;
	u32	dclkcnt;
	u32	dclkstat;
	u32	gpo;			/* 0x10 */
	u32	gpi;
	u32	misci;			/* 0x18 */
	u32	_pad_0x1c_0x82c[517];

	/* Configuration Monitor (MON) Registers */
	u32	gpio_inten;		/* 0x830 */
	u32	gpio_intmask;
	u32	gpio_inttype_level;
	u32	gpio_int_polarity;
	u32	gpio_intstatus;		/* 0x840 */
	u32	gpio_raw_intstatus;
	u32	_pad_0x848;
	u32	gpio_porta_eoi;
	u32	gpio_ext_porta;		/* 0x850 */
	u32	_pad_0x854_0x85c[3];
	u32	gpio_1s_sync;		/* 0x860 */
	u32	_pad_0x864_0x868[2];
	u32	gpio_ver_id_code;
	u32	gpio_config_reg2;	/* 0x870 */
	u32	gpio_config_reg1;
};

#define FPGAMGRREGS_STAT_MODE_MASK		0x7
#define FPGAMGRREGS_STAT_MSEL_MASK		0xf8
#define FPGAMGRREGS_STAT_MSEL_LSB		3

#define FPGAMGRREGS_CTRL_CFGWDTH_MASK		0x200
#define FPGAMGRREGS_CTRL_AXICFGEN_MASK		0x100
#define FPGAMGRREGS_CTRL_NCONFIGPULL_MASK	0x4
#define FPGAMGRREGS_CTRL_NCE_MASK		0x2
#define FPGAMGRREGS_CTRL_EN_MASK		0x1
#define FPGAMGRREGS_CTRL_CDRATIO_LSB		6

#define FPGAMGRREGS_MON_GPIO_EXT_PORTA_CRC_MASK	0x8
#define FPGAMGRREGS_MON_GPIO_EXT_PORTA_ID_MASK	0x4
#define FPGAMGRREGS_MON_GPIO_EXT_PORTA_CD_MASK	0x2
#define FPGAMGRREGS_MON_GPIO_EXT_PORTA_NS_MASK	0x1

/* FPGA Mode */
#define FPGAMGRREGS_MODE_FPGAOFF		0x0
#define FPGAMGRREGS_MODE_RESETPHASE		0x1
#define FPGAMGRREGS_MODE_CFGPHASE		0x2
#define FPGAMGRREGS_MODE_INITPHASE		0x3
#define FPGAMGRREGS_MODE_USERMODE		0x4
#define FPGAMGRREGS_MODE_UNKNOWN		0x5


#define SYSMGR_ROMCODEGRP_CTRL_WARMRSTCFGPINMUX	(1 << 0)
